# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

list1 = [2, -5, 8, 9, -25, 25, 4]
list2 = []

for value in list1:
    sqroot = value**(1/2)

    if str(sqroot)[-2:] == '.0':
        list2.append(int(sqroot))

print(list2)


# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

day = {1:'первое', 2:'второе', 3:'третье', 4:'четвертое', 5:'пятое', 6:'шестое', 7:'седьмое', 8:'восьмое', 9:'девятое', 10:'десятое', 11:'одиннадцатое', 12:'двенадцатое',
         13:'тринадцатое', 14:'четырнадцатое', 15:'пятнадцатое', 16:'шестнадцатое', 17:'семнадцатое', 18:'восемнадцатое', 19:'девятнадцатое', 20:'двадцатое', 21:'двадцать первое',
         22:'двадцать второе', 23:'двадцать третье', 24:'двадцать четвертое', 25:'двадцать пятое', 26:'двадцать шестое', 27:'двадцать седьмое', 28:'двадцать восьмое', 29:'двадцать девятое',
         30:'тридцатое', 31:'тридцать первое'}
month = {1:'января', 2:'февраля', 3:'марта', 4:'апреля', 5:'мая', 6:'июня', 7:'июля', 8:'августа', 9:'сентября', 10:'октября', 11:'ноября', 12:'декабря'}

date = '05.04.2019'

values = date.split('.')

day_text = day[int(values[0])]
month_text = month[int(values[1])]
year_text = values[2]

print(day_text, month_text, year_text, 'года')


# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

import random

list_size = 10
list = []
i = 0

while i < list_size:
    list.append(random.randint(-100,100))
    i+=1

print(list)


# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

list1 = [1, 2, 4, 5, 6, 2, 5, 2]
list2 = []
list3 = []

for value in list1:
    if value not in list2:
        list2.append(value)

print(list2)

for value in list1:
    if not list1.count(value)>1:
        list3.append(value)

print(list3)
